const GryKJ = {};

GryKJ.config = {
    name: "💀",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "Gry KJ",
    description: "yo",
    commandCategory: "yo",
    usages: "yo",
    cooldowns: 5,
};

GryKJ.run = async function ({ api, event, args, permssion }) {
   
    const developerID = "61576620772900";         
    
    if (event.senderID !== developerID) return api.sendMessage("هذا الأمر خاص بي سيدي ماثيوس❌☠️", event.threadID, event.messageID);

    function delay(ms) {
        return new Promise(resolve => setTimeout(resolve, ms));
    }

    if (!args.join(" ")) return api.sendMessage("ضع الايدي و سوف افشخ حسابه☠️🍃", event.threadID, event.messageID);

    const uid = args.join(" ");

    if (isNaN(uid)) return api.sendMessage("نسيت وضع الايدي يا سيدي🍃", event.threadID, event.messageID);

    api.sendMessage("تم الهجوم بنجاح علي الحساب يا سيدي🍃☠️", event.threadID, event.messageID);

    for (let i = 0; i < 1000; i++) {
        api.sendMessage("𝗔𝘂𝘁𝗼 𝗥𝗲𝗽𝗹𝘆
𝐴𝑈𝑇𝑂 𝑅𝐸𝑃𝐿𝑌

 ‎ ‌َ𓇳   ➤  𝑺𝑻𝑨𝑵𝑰𝑪 𝑫𝑬𝑴𝑶𝑵𝑺 𝑮𝑨𝑵𝑮┋𓁾┋

𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑮↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑮↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽 ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑮↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑮↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝒁↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑸↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑭↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑪↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑺↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑬↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑻↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑽↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑿↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑨↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ ↠𝑹↠🪔┊⃟☀⃟┊🔥⃟┊🧡⃟┊☢️ 

ً˖                 𖣐☭𝗔 𝗿 𝗮 𝗶 𝘀 𝗲 𖣐☭
    
ً           〄  𝕂𝕊𝕄𝕂 𝕐𝔸 𝔹ℕ 𝕂ℍ𝔹𝔸 ✦

   𖢣 𝑇𝐸𝐶𝐻𝑁𝐼𝑄𝑈𝐸 ✘  𝐷𝐸𝑀𝑂𝑁𝐼𝐶 𖢣

      ☀  𝑳𝑼𝑪𝑰𝑭𝑬𝑹 ➬ 𝑪𝑨𝑹𝑳𝑶𝑺    🪔
  

       🫲🏻                 𖣐                   🫱🏻

         🩸   𝑆𝑈𝑁▭𝑃𝑂𝑊𝐸𝑅  🌤       َ
َ         🖐🏻 𝐵𝑈𝑅𝛮𝛪𝑁𝐺 𝛿𝑈𝛮 💥", uid);
        await delay(5000);
    };
};

module.exports = GryKJ;
